[
{"title": "DPS Honors Exceptional, Lifesaving Efforts", "link": "http://www.dps.texas.gov/director_staff/media_and_communications/pr/2018/1026a", "desc": "AUSTIN - The Texas Public Safety Commission (PSC) and Texas Department of Public Safety (DPS) Director Steven McCraw presented two Medals of Valor, one Director's Citation and eight Lifesaving Awards to DPS employees", "date": "Thursday, October 25, 2018"},
{"title": "FBI and DPS Lead Statewide Full-Scale Training Exercise", "link": "http://www.dps.texas.gov/director_staff/media_and_communications/pr/2018/1025a", "desc": "AUSTIN - The four Texas Divisions of the Federal Bureau of Investigation (Dallas, El Paso, Houston and San Antonio) and the Texas Department of Public Safety will lead a statewide Full-Scale Training Exercise (FTX) beginning Sunday, Oct. 28", "date": "Wednesday, October 24, 2018"},
{"title": "Reward Offered for Most Wanted Sex Offender from Dallas", "link": "http://www.dps.texas.gov/director_staff/media_and_communications/pr/2018/1024a", "desc": "AUSTIN - The Texas Department of Public Safety (DPS) has added Mary Francis Martinez, 41, to the Texas 10 Most Wanted Sex Offenders list, and a cash reward of up to $3,000 is now being offered for information leading to her capture", "date": "Friday, October 19, 2018"},
{"title": "DPS Bolsters Efforts to Increase School Bus Safety", "link": "http://www.dps.texas.gov/director_staff/media_and_communications/pr/2018/1019a", "desc": "AUSTIN - In conjunction with National School Bus Safety Week (Oct. 22-26), the Texas Department of Public Safety (DPS) is urging Texans to comply with laws prohibiting drivers from passing stopped school buses", "date": "Monday, October 15, 2018"},
{"title": "DPS Offers Increased Reward, Seeks Leads in 1994 Brooks County Cold Case", "link": "http://www.dps.texas.gov/director_staff/media_and_communications/pr/2018/1015a", "desc": "AUSTIN - The Texas Department of Public Safety (DPS) is asking for the public's help in solving the disappearance of Rena Rincones, and an increased reward of up to $6,000 is being offered for information that leads to the arrest", "date": "Monday, October 1, 2018"},
{"title": "Reward Increased to $8,000 for Most Wanted Sex Offender from El Paso", "link": "http://www.dps.texas.gov/director_staff/media_and_communications/pr/2018/1001a", "desc": "AUSTIN - The reward for Manuel Raul Maese, 64, a Texas 10 Most Wanted Sex Offender and this month's featured fugitive, has been increased to $8,000 for information leading to his capture if the tip is received in the month of October", "date": "Wednesday, September 26, 2018"},
{"title": "Reward Offered for Most Wanted Fugitive, Gang Member from Houston", "link": "http://www.dps.texas.gov/director_staff/media_and_communications/pr/2018/0926a", "desc": "AUSTIN - The Texas Department of Public Safety (DPS) has added Rolando Tomas Mendez, 27, to the Texas 10 Most Wanted Fugitives list, and a cash reward of up to $7,500 is now being offered for information leading to his capture", "date": "Thursday, September 20, 2018"},
{"title": "Reminder: DPS Museum Day Offers Interactive Activities, Showcases DPS Resources", "link": "http://www.dps.texas.gov/director_staff/media_and_communications/pr/2018/0920a", "desc": "AUSTIN - The Texas Department of Public Safety (DPS) is reminding the public that they are invited to attend DPS Museum Day this Sunday, Sept. 23, as part of Austin Museum Day", "date": "Wednesday, September 19, 2018"},
{"title": "Reminder: Reward Increased for Most Wanted Fugitive from Madison County", "link": "http://www.dps.texas.gov/director_staff/media_and_communications/pr/2018/0919b", "desc": "AUSTIN - The Texas Department of Public Safety (DPS) is reminding the public that the reward for Jared Luke Langley, 36, a Texas 10 Most Wanted Fugitive and this month's featured fugitive, has been increased to $12,500 for information leading to his capture if the tip is received during the month of September", "date": "Wednesday, September 19, 2018"},
{"title": "DPS Remembers Legacy of Retired Colonel Thomas Davis", "link": "http://www.dps.texas.gov/director_staff/media_and_communications/pr/2018/0919a", "desc": "AUSTIN - The Texas Department of Public Safety (DPS) is remembering the life of retired DPS Colonel Thomas \"Tommy\" A. Davis Jr. who passed away on Friday, Sept. 14, 2018, at the age of 77", "date": "Monday, September 17, 2018"}
]